import Image1 from './images/image1.jpg';
import Image2 from './images/image2.jpg';
import Image3 from './images/image3.jpg';
import Image4 from './images/image4.jpg';
import Image5 from './images/image5.jpg';
import Image6 from './images/image6.jpg';
import Image7 from './images/image7.jpg';
import Image8 from './images/image8.jpg';
import Image9 from './images/image9.jpg';
import Image10 from './images/image10.jpg';

const structures = [
  {
    img: Image1,
    title: 'Раффлз-Сити, Китай',
    description: [
      `Раффлз-Сити — комплекс небоскрёбов, расположенный в китайском городе Чунцин, в деловом районе Юйчжун. Построен в 2019 году. Архитекторами комплекса выступили Моше Сафди и Чунцинский архитектурный институт, владельцем является сингапурская группа CapitaLand.`,
      `В состав многофункционального комплекса Раффлз-Сити входят восемь высотных башен и обширный подиум, в котором располагаются продуктовый супермаркет, магазины, автосалоны, рестораны, выставочные залы и паркинг. Общая площадь комплекса — свыше 1,1 млн м².`
    ]
  },
  {
    img: Image2,
    title: 'Авичи-Арена, Швеция',
    description: [
      `Авичи-Арена — 85-метровая многоцелевая арена в Стокгольме. Второе по величине сферическое сооружение в мире. Место проведения концертов и спортивных мероприятий.`,
      `Арена была построена специально к чемпионату мира по хоккею 1989 года и открыта 19 февраля 1989 года.`
    ]
  },
  {
    img: Image3,
    title: 'Труба ГРЭС-2, Казахстан',
    description: [
      `Железобетонная дымовая труба, построенная в 1987 году, имея высоту 420 м, является самой высокой в мире и занесена в Книгу рекордов Гиннесса.`,
      `ГРЭС-2 вырабатывает электроэнергию из высокозольного экибастузского угля двумя энергоблоками по 500 МВт.`
    ]
  },
  {
    img: Image4,
    title: 'Бурдж-Халифа, Дубай, ОАЭ',
    description: [
      `Небоскрёб высотой 828 метров, самое высокое сооружение в мире. Форма здания напоминает сталагмит.`,
      `Строительство небоскрёба началось в 2004 году и шло со скоростью 1—2 этажа в неделю. Ежедневно на строительстве работало до 12 000 рабочих.`
    ]
  },
  {
    img: Image5,
    title: 'Интинская радиомачта, Инта, Россия',
    description: [
      `На подъезде к железнодорожной станции Инта 1 бросается в глаза металлическая вышка-мачта высотой 462,8 метра.`,
      `Антенна навигационной системы «Чайка» предназначена для определения координат самолётов и кораблей.`
    ]
  },
  {
    img: Image6,
    title: 'Ворота Запада, США',
    description: [
      `Арка в Сент-Луисе, также известная под именем «Врата на запад», является визитной карточкой Сент-Луиса, штат Миссури, США.`,
      `Арка была спроектирована финско-американским архитектором Ээро Саариненом. Её высота 192 метра в самой высокой точке.`
    ]
  },
  {
    img: Image7,
    title: 'CN Tower, Торонто, Канада',
    description: [
      `553,3-метровая телевизионная башня. Была самым высоким свободно стоящим сооружением в мире с 1976 по 2007 год.`,
      `Земляные работы для сооружения железобетонной конструкции начались 12 февраля 1973 года, а 2 апреля 1975 года возведение башни было завершено.`
    ]
  },
  {
    img: Image8,
    title: 'Небесное дерево, Токио, Япония',
    description: [
      `Телевизионная башня в районе Сумида — самая высокая среди телебашен мира. Высота телебашни вместе с антенной составляет 634 метра.`,
      `Здание напоминает пятиярусную пагоду, что хорошо сочетается с историческим районом Асакуса.`
    ]
  },
  {
    img: Image9,
    title: 'The Clock Towers, Мекка, Саудовская Аравия',
    description: [
      `Отель «Королевская часовая башня» имеет высоту 601 м. Его строительство завершилось в 2012 году.`,
      `На Королевской башне установлены часы диаметром 43 метра, расположенные на высоте более 400 метров над землёй.`
    ]
  },
  {
    img: Image10,
    title: 'Merdeka 118, Куала-Лумпур, Малайзия',
    description: [
      `Общая высота здания составляет 678,9 м, причём более 160 м приходится на шпиль. Строительство Merdeka 118 началось в 2014 году.`,
      `Название «Merdeka» означает «независимость». Оно отсылает к расположенному рядом стадиону, связанному с провозглашением независимости.`,
      `В небоскрёбе откроется первый отель Park Hyatt в Малайзии. Также в здании будут расположены смотровая площадка, торговый центр, музей, мечеть, офисы и квартиры.`
    ]
  }
];

export default structures;